In [2]:
import pandas as pd

# pandas series

In [3]:
ser = pd.Series(data=[100,100,100,100],index=['a','b','c','d'])
ser

a    100
b    100
c    100
d    100
dtype: int64

In [4]:
ser = pd.Series([100,100,100,100],['a','b','c','d'])
ser

a    100
b    100
c    100
d    100
dtype: int64

In [5]:
ser.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [6]:
print(ser.index)

Index(['a', 'b', 'c', 'd'], dtype='object')

In [12]:
ser['a']

100

In [13]:
ser.loc['a']

100

In [14]:
ser[['a','b','c']]

a    100
b    100
c    100
dtype: int64

In [15]:
ser[[0,1,2]]

a    100
b    100
c    100
dtype: int64

In [16]:
ser.iloc[[0,1,2]]

a    100
b    100
c    100
dtype: int64

In [17]:
ser[0]

100

In [19]:
bool='e' in ser
bool

False

In [20]:
bool='a' in ser
bool

True

# Arithmetic operations

In [22]:
se=ser*3
se

a    300
b    300
c    300
d    300
dtype: int64

In [23]:
se=ser**2
se

a    10000
b    10000
c    10000
d    10000
dtype: int64

In [24]:
se=ser/2
se

a    50.0
b    50.0
c    50.0
d    50.0
dtype: float64

# Dataframe

#### key value pair like dictionary but here valuess are Series

In [54]:
df={'one':pd.Series([10,20,30],['a','b','c']),
   'two':pd.Series([10,20,30],['a','b','c'])}

### now we need to convert the dictionary to dataframe

In [55]:
dff=pd.DataFrame(df)
dff

   one  two
a   10   10
b   20   20
c   30   30

# dataframe as list of dictionaries

In [56]:
df=[{'one':10,'two':10},{'one':20,'two':20},{'one':30,'two':30}]
d=pd.DataFrame(df,index=['a','b','c'])
d

   one  two
a   10   10
b   20   20
c   30   30

In [57]:
pd.DataFrame(df,columns=['one'])

   one
0   10
1   20
2   30

# Basic DataFrame Operations

In [67]:
ar=pd.DataFrame(d,index=['a','b'])
ar

   one  two
a   10   10
b   20   20

In [68]:
ar['one']

a    10
b    20
Name: one, dtype: int64

In [69]:
ar[['one','two']]

   one  two
a   10   10
b   20   20

In [70]:
ar['sum']=ar['one']+ar['two']
ar

   one  two  sum
a   10   10   20
b   20   20   40

In [72]:
ar['bool']=ar['sum']>30
ar

   one  two  sum   bool
a   10   10   20  False
b   20   20   40   True

In [88]:
ar

   two
a   10
b   20

In [89]:
a

   one  two  sum
a   10   10   20
b   20   20   40

In [90]:
col=a.pop('sum')
col

a    20
b    40
Name: sum, dtype: int64

In [94]:
a

   two
a   10
b   20

In [95]:
del a['two']
a

Empty DataFrame
Columns: []
Index: [a, b]

In [96]:
df=[{'one':10,'two':10},{'one':20,'two':20},{'one':30,'two':30}]
d=pd.DataFrame(df,index=['a','b','c'])

In [97]:
d

   one  two
a   10   10
b   20   20
c   30   30

In [98]:
d.insert(1,'between',d['one'])
d

   one  between  two
a   10       10   10
b   20       20   20
c   30       30   30

In [99]:
del d['between']

In [100]:
d

   one  two
a   10   10
b   20   20
c   30   30

In [101]:
d['between']=d['one'][:2]
d

   one  two  between
a   10   10     10.0
b   20   20     20.0
c   30   30      NaN

In [102]:
del d['between']
d

   one  two
a   10   10
b   20   20
c   30   30